

class SecondVocab(object):

    def __init__(self):

        self.w2i = {'1': '酒店位置', '2': '酒店服务', '3': '酒店餐饮', '4': '客房设施', '5': '整体舒适度'}
        self.i2w = ['酒店位置', '酒店服务', '酒店餐饮', '客房设施', '整体舒适度']

    def word2id(self, xx):
        return self.w2i.get(xx)

    def id2word(self, xx):
        return self.i2w[xx]

    @property
    def getsize(self):
        return len(self.i2w)


class ThirdVocab(object):

    def __init__(self):
        self.w2i = {'11': '位置', '12': '交通', '13': '周边环境', '14': '地理总体评价', '21': '门童服务', '22': '接送服务',
                    '23': '行李服务', '24': '前台服务', '25': '安全性', '26': '客房清扫服务', '28': '泊车服务',
                    '27': '服务整体评价', '31': '餐厅环境', '32': '餐厅服务', '33': '早餐', '34': '菜品', '35': '送餐服务',
                    '36': '餐饮整体评价', '41': '客房隔音', '42': '客房床品', '43': '客房家具', '44': '客房浴室', '45': '客房电器',
                    '46': '客房生活用品', '47': '客房细节', '48': '客房卫生', '410': '客房硬件设施', '411': '房价',
                    '49': '客房整体评价', '51': '酒店装饰及风格', '52': '酒店环境及设施', '53': '休闲娱乐设施', '54': '酒店整体卫生'}

        self.i2w = ['位置', '交通', '周边环境', '地理总体评价', '门童服务', '接送服务', '行李服务', '前台服务', '安全性',
                    '客房清扫服务', '泊车服务', '服务整体评价', '餐厅环境', '餐厅服务', '早餐', '菜品', '送餐服务', '餐饮整体评价',
                    '客房隔音', '客房床品', '客房家具', '客房浴室', '客房电器', '客房生活用品', '客房细节', '客房卫生', '客房硬件设施',
                    '房价', '客房整体评价', '酒店装饰及风格', '酒店环境及设施', '休闲娱乐设施', '酒店整体卫生']

    def word2id(self, xx):
        return self.w2i.get(xx)

    def id2word(self, xx):

        return self.i2w[xx]

    @property
    def getsize(self):
        return len(self.i2w)

# ('','')